<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-05  0.261758 -0.299979  0.267228  2.429107
2013-01-06  0.612693 -1.837019  1.139148 -0.973891

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-05  0.261758 -0.299979  0.267228  2.429107

In [8]:
df.tail()

                   A         B         C         D
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-05  0.261758 -0.299979  0.267228  2.429107
2013-01-06  0.612693 -1.837019  1.139148 -0.973891

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-05  0.261758 -0.299979  0.267228  2.429107
2013-01-06  0.612693 -1.837019  1.139148 -0.973891

In [12]:
df.to_numpy()

array([[-0.62442408, -0.57735998, -0.80031044, -0.60550472],
       [ 0.53261118,  0.46675469,  0.35686073,  0.79172562],
       [-0.32290856, -0.52598069, -0.31587955, -0.36183477],
       [ 0.97127122, -0.12700149, -0.66772451,  1.91061184],
       [ 0.26175766, -0.29997858,  0.26722844,  2.42910734],
       [ 0.61269253, -1.83701854,  1.13914782, -0.97389148]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-05  0.261758 -0.299979  0.267228  2.429107
2013-01-06  0.612693 -1.837019  1.139148 -0.973891

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.624424    0.532611   -0.322909    0.971271    0.261758    0.612693
B   -0.577360    0.466755   -0.525981   -0.127001   -0.299979   -1.837019
C   -0.800310    0.356861   -0.315880   -0.667725    0.267228    1.139148
D   -0.605505    0.791726   -0.361835    1.910612    2.429107   -0.973891

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-05  0.261758 -0.299979  0.267228  2.429107
2013-01-06  0.612693 -1.837019  1.139148 -0.973891

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.605505 -0.800310 -0.577360 -0.624424
2013-01-02  0.791726  0.356861  0.466755  0.532611
2013-01-03 -0.361835 -0.315880 -0.525981 -0.322909
2013-01-04  1.910612 -0.667725 -0.127001  0.971271
2013-01-05  2.429107  0.267228 -0.299979  0.261758
2013-01-06 -0.973891  1.139148 -1.837019  0.612693

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.612693 -1.837019  1.139148 -0.973891
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-05  0.261758 -0.299979  0.267228  2.429107
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-02  0.532611  0.466755  0.356861  0.791726

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01   -0.624424
2013-01-02    0.532611
2013-01-03   -0.322909
2013-01-04    0.971271
2013-01-05    0.261758
2013-01-06    0.612693
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-04  0.971271 -0.127001 -0.667725  1.910612

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A   -0.624424
B   -0.577360
C   -0.800310
D   -0.605505
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.624424 -0.577360
2013-01-02  0.532611  0.466755
2013-01-03 -0.322909 -0.525981
2013-01-04  0.971271 -0.127001
2013-01-05  0.261758 -0.299979
2013-01-06  0.612693 -1.837019

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02  0.532611  0.466755
2013-01-03 -0.322909 -0.525981
2013-01-04  0.971271 -0.127001

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A    0.532611
B    0.466755
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

-0.6244240756413102

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

-0.6244240756413102

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [32]:
df.iloc[3]

A    0.971271
B   -0.127001
C   -0.667725
D    1.910612
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [33]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.971271 -0.127001
2013-01-05  0.261758 -0.299979

정수 리스트를 통해 표현

In [34]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.532611  0.356861
2013-01-03 -0.322909 -0.315880
2013-01-05  0.261758  0.267228

row(행)만 슬라이싱을 합니다.

In [35]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835

columns(열)만 슬라이싱 합니다.

In [36]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.577360 -0.800310
2013-01-02  0.466755  0.356861
2013-01-03 -0.525981 -0.315880
2013-01-04 -0.127001 -0.667725
2013-01-05 -0.299979  0.267228
2013-01-06 -1.837019  1.139148

value(값)로 가져옵니다.

In [37]:
df.iloc[1,1]

0.46675468918349966

scalar를 빠르게 엑세스하여 가져옵니다.

In [38]:
df.iat[1,1]

0.46675468918349966

#Boolean indexing

single column의 value를 통해 선택합니다.

In [42]:
df[df["A"]>0]

                   A         B         C         D
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-05  0.261758 -0.299979  0.267228  2.429107
2013-01-06  0.612693 -1.837019  1.139148 -0.973891

In [44]:
df

                   A         B         C         D
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835
2013-01-04  0.971271 -0.127001 -0.667725  1.910612
2013-01-05  0.261758 -0.299979  0.267228  2.429107
2013-01-06  0.612693 -1.837019  1.139148 -0.973891

In [43]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.532611  0.466755  0.356861  0.791726
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  0.971271       NaN       NaN  1.910612
2013-01-05  0.261758       NaN  0.267228  2.429107
2013-01-06  0.612693       NaN  1.139148       NaN

isin() method를 통해 필터링

In [45]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01 -0.624424 -0.577360 -0.800310 -0.605505    one
2013-01-02  0.532611  0.466755  0.356861  0.791726    one
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835    two
2013-01-04  0.971271 -0.127001 -0.667725  1.910612  three
2013-01-05  0.261758 -0.299979  0.267228  2.429107   four
2013-01-06  0.612693 -1.837019  1.139148 -0.973891  three

In [46]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03 -0.322909 -0.525981 -0.315880 -0.361835   two
2013-01-05  0.261758 -0.299979  0.267228  2.429107  four